Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་ཅིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བཟོད་པ་གསུམ་གྱི་ཡེ་ཤེས་ལ་མཁས་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should become skilled in the wisdoms of the three kinds of patience.

source: །དེས་བཟོད་པ་དང་པོ་རབ་ཏུ་ཤེས་པར་བྱ།
en: They should know the first patience.

source: བཟོད་པ་གཉིས་པ་རབ་ཏུ་ཤེས་པར་བྱ།
en: They should know the second patience.

source: བཟོད་པ་གསུམ་པ་རབ་ཏུ་ཤེས་པར་བྱ་སྟེ།
en: They should know the third patience.

source: བཟོད་པ་གསུམ་གྱི་ཁྱད་པར་ལ་མཁས་པར་བྱའོ། །བཟོད་པ་གསུམ་གྱི་ཡེ་ཤེས་ཀྱི་ཁྱད་པར་ལ་མཁས་པར་བྱའོ།
en: They should become skilled in the differences between the three kinds of patience and skilled in the differences between the wisdoms of the three kinds of patience.

source: གཞོན་ནུ་འདི་ལྟར་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་གསུམ་གྱི་ཁྱད་པར་ལ་མཁས་པར་གྱུར་ཅིང་། བཟོད་པ་གསུམ་གྱི་ཡེ་ཤེས་ཀྱི་ཁྱད་པར་ལ་མཁས་པར་གྱུར་པ་དེའི་ཚེ་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་མྱུར་དུ་ཏིང་ངེ་འཛིན་འདི་འཐོབ་ཅིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Young man, when bodhisattva mahāsattvas become skilled in the differences between the three kinds of patience and become skilled in the differences between the wisdoms of the three kinds of patience, then at that time, young man, bodhisattva mahāsattvas will quickly attain this samādhi, and will quickly attain the highest, complete enlightenment of perfect buddhahood.

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བཟོད་པ་གསུམ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བྱའོ།
en: “Therefore, young man, bodhisattva mahāsattvas who wish to attain the highest, complete enlightenment of perfect buddhahood should learn this Dharma teaching on gaining the three kinds of patience.

source: །བཟུང་ནས་ཀྱང་གཞན་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྟེ།
en: When they have learned it they should teach it widely to others.

source: དེ་ནི་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་བདེ་བར་འགྱུར་རོ།
en: That will be of benefit to many beings, it will bring happiness to many beings, it will be a kindness to the world, it will bring fulfillment to a multitude of beings, and bring benefit and happiness to humans and devas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཟོད་པ་གསུམ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Then the Bhagavān taught this Dharma discourse on gaining the three kinds of patience by chanting the following verses to the youth Candraprabha.

source: །སུ་དག་དང་ཡང་རྩོད་པར་མི་བྱེད་ཅིང་།
en: “Those who do not argue

source: །དོན་མེད་ལྡན་པའི་ཚིག་རྣམས་མི་སྨྲ་སྟེ།
en: Or speak unbeneficial words

source: །དོན་དང་ཆོས་ལ་རྟག་པར་རབ་ཏུ་གནས།
en: But always bring benefit and maintain the Dharma,

source: །འདི་དག་བཟོད་པ་དང་པོར་བཤད་པ་ཡིན།
en: Such people are explained as having the first patience. {1}

source: །ཆོས་རྣམས་ཐམས་ཅད་སྒྱུ་མ་འདྲར་ཤེས་ཏེ།
en: “Knowing that all phenomena are like illusions,

source: །དེ་ནི་མཚན་མའི་སྤྱོད་ཡུལ་ལྡན་མ་ཡིན།
en: Not having a conceptual field of experience,

source: །ཡེ་ཤེས་འཕེལ་བའི་ས་ལས་མི་ཉམས་ཏེ།
en: And not falling from the level of increasing wisdom

source: །འདི་དག་བཟོད་པ་དང་པོའི་ཁྱད་པར་རོ།
en: Are distinctive qualities of the first patience. {2}

source: །མདོ་སྡེའི་ཚུལ་ཀུན་ལ་ཡང་དེ་མཁས་ཤིང་།
en: “Being skilled in all the paths of the sūtras,

source: །ལེགས་པར་སྨྲས་ལ་མཁས་པ་ཤིན་ཏུ་མོས།
en: Being wise and attracted to the Buddha’s words,

source: །བདེར་གཤེགས་མཁྱེན་ལ་མཐའ་ཡས་ཡེ་ཤེས་ཅན།
en: And having the infinite awareness of the sugatas’ wisdom

source: །ལེགས་པར་བཤད་པའི་ཆོས་ནི་གང་ཐོས་ཀྱང་།
en: “Whatever Dharma taught by the Buddha they hear,

source: །སངས་རྒྱས་དག་གིས་བཤད་པར་ཐེ་ཚོམ་མེད།
en: They have no doubt about the Buddha’s teachings

source: །རྒྱལ་བ་ཀུན་གྱི་ཆོས་ལ་དེ་མོས་ཏེ། །འདི་དག་བཟོད་པ་དང་པོའི་ཁྱད་པར་རོ།
en: But aspire to the Dharma of all the jinas. These are distinctive qualities of the first patience. {4} “They know the particular sūtra with the definitive meaning,

source: །སྟོང་པ་བདེ་བར་གཤེགས་པས་བཤད་པ་ལྟར། །ངེས་དོན་མདོ་སྡེ་དག་གི་བྱེ་བྲག་ཤེས། །གང་ལས་སེམས་ཅན་གང་ཟག་སྐྱེས་བུ་བསྟན།
en: Such as the Sugata’s teaching on emptiness.

source: །ཆོས་དེ་ཐམས་ཅད་དྲང་བའི་དོན་དུ་ཤེས།
en: They know that all the Dharmas that teach Of beings, individuals, and persons are provisional truth. {5}

source: །འཇིག་རྟེན་འདི་ན་མུ་སྟེགས་མང་ཡོད་པ།
en: “In this world there are many tīrthikas,

source: །དེ་དག་ལ་ཡང་དེ་ནི་ཡིད་མི་ཁྲོ།
en: But they feel no anger toward them.

source: །དེ་དག་ལ་ནི་སྙིང་རྗེ་ཉེ་བར་འཇོག །འདི་དག་བཟོད་པ་དང་པོའི་ཁྱད་པར་རོ།
en: They are firmly established in compassion for them. These are distinctive qualities of the first patience. {6}

source: །དེ་ལ་གཟུངས་རྣམས་ཡོངས་སུ་སྣང་བར་འགྱུར།
en: “The retentions become apparent to them

source: །སྣང་བ་དེ་ལ་ནམ་ཡང་ཐེ་ཚོམ་མེད།
en: And they have no doubts concerning their appearance.

source: །བདེན་པའི་རྗེས་སུ་འབྲང་བའི་ཚིག་སྨྲས་ཏེ།
en: What they speak is in accord with the truth.

source: འདི་དག་བཟོད་པ་དང་པོའི་ཁྱད་པར་རོ།
en: These are distinctive qualities of the first patience. {7}

source: །རླུང་དང་ཆུ་དང་མེ་དང་ས་རྣམས་ཀྱི། ཁམས་བཞི་པོ་ནི་རྣམ་པ་གཞན་འགྱུར་ཡང་།
en: “The four elements of air and water, Fire and earth may change into something else,

source: །སངས་རྒྱས་བྱང་ཆུབ་ལས་ནི་དེ་མི་ལྡོག །འདི་དག་བཟོད་པ་དང་པོའི་ཁྱད་པར་རོ།
en: But they will never turn away from the enlightenment of buddhahood. These are distinctive qualities of the first patience. {8}

source: །འཇིག་རྟེན་བཟོ་གནས་མང་པོ་ཅི་ཡོད་པ།
en: “Whatever skills there are in the world,

source: །ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་དེས་བསླབས་ཏེ།
en: The bodhisattvas learn them all,

source: །བདག་ལས་ལྷག་པ་སུ་ཡང་མི་མཐོང་བ།
en: And no one sees anyone higher than them.

source: །ཞི་གནས་སྟོབས་ཀྱིས་བསྐྱོད་པ་མེད་གྱུར་ཅིང་།
en: “They are unwavering through the power of śamatha,

source: །ལྷག་མཐོང་གིས་ནི་རི་བོ་ལྟ་བུར་གྱུར།
en: And through vipaśyanā they are like a mountain.

source: །སེམས་ཅན་ཀུན་གྱིས་འཁྲུགས་པར་མི་ནུས་ཏེ།
en: Even all beings together would be unable to disturb them.

source: །དེ་ནི་བཟོད་པ་གཉིས་སུ་བཤད་པ་ཡིན།
en: These are distinctive qualities of the second patience. {10}

source: །མཉམ་པར་བཞག་བཞིན་དུ་ནི་ལྡང་ཞིང་སྨྲ།
en: “In meditation they stand and talk;

source: །མཉམ་པར་བཞག་པས་འདུག་ཅིང་འཆག་པར་བྱེད།
en: Remaining in meditation they walk.

source: །མཁས་པ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཕྱིན།
en: In meditation they master the perfections.

source: །འདི་དག་བཟོད་པ་གཉིས་པའི་ཁྱད་པར་རོ།
en: These are distinctive qualities of the second patience. {11}

source: །མཉམ་པར་བཞག་པས་མངོན་ཤེས་ལྔ་ཐོབ་སྟེ།
en: “In meditation they attain the five higher knowledges.

source: །ཆོས་རྣམས་སྟོན་ཅིང་ཞིང་ནི་བརྒྱར་ཡང་འགྲོ།
en: Teaching the Dharma they go to a hundred realms.

source: །དེ་ནི་རྫུ་འཕྲུལ་སྟོབས་ལས་མི་ཉམས་ཏེ།
en: They do not lose their miraculous powers.

source: །དེ་ནི་དེ་འདྲའི་ཏིང་འཛིན་ཞི་བ་བསྟན།
en: “They remain in that kind of samādhi of peace.

source: །མཉམ་པར་བཞག་པ་དེ་ཡི་སེམས་ཀྱི་ཚོད།
en: They attain certainty of the mind,

source: །འཛིན་ནུས་པ་ཡི་སེམས་ཅན་གང་ཡང་མེད།
en: And in their meditation there is no ‘being.’

source: །འཇིག་རྟེན་འདི་ན་གང་ཡོད་སེམས་ཅན་ཀུན། །དེ་དག་སངས་རྒྱས་མཁྱེན་པས་ཆོས་སྟོན་ཀྱང་།
en: To all of the beings who are in the world,

source: །བཤད་པ་ཐམས་ཅད་དེ་བཞིན་འཛིན་ནུས་ཏེ།
en: And they are able to remember all that they have taught.

source: །ཤར་དང་ལྷོ་དང་ནུབ་དང་བྱང་ཕྱོགས་དང་། །སྟེང་དང་འོག་དང་དེ་བཞིན་ཕྱོགས་མཚམས་ནི། །ཐམས་ཅད་ན་ཡང་འཇིག་རྟེན་མགོན་པོ་མཐོང་།
en: “They see the lords of the worlds in all directions: East, south, west, and north, Above, below, and in the intermediate directions.

source: །དེ་ནི་བཟོད་པ་གསུམ་པར་བསྟན་པ་ཡིན།
en: These are distinctive qualities of the third patience. {15}

source: །གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྐུ་ལུས་སུ།
en: “They have a body that is the color of gold

source: །འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་སྤྲུལ་ནས་ནི།
en: And emanate countless manifestations,

source: །སྲོག་ཆགས་བྱེ་བ་མང་ལ་ཆོས་སྟོན་ཏེ།
en: Teaching the Dharma to many millions of beings.

source: །འདི་དག་བཟོད་པ་གསུམ་པའི་ཁྱད་པར་རོ།
en: These are distinctive qualities of the third patience. {16} “Each such bodhisattva appears throughout

source: །སངས་རྒྱས་ཞིང་འདིའི་འཛམ་བུའི་གླིང་ཀུན་ན། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྣང་བར་འགྱུར།
en: This buddha realm of Jambudvīpa

source: །འཇིག་རྟེན་ལྷ་དང་ལྷ་མིན་བཅས་པར་གྲགས། །འདི་དག་བཟོད་པ་གསུམ་པའི་ཁྱད་པར་རོ། །སངས་རྒྱས་སྤྱོད་ཡུལ་དེ་བཞིན་ཆོ་ག་དང་། །བདེ་བར་གཤེགས་པའི་སྤྱོད་ལམ་ཅི་འདྲ་བ། །ཀུན་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེས་བསླབས་ཏེ།
en: And is renowned also among the devas and asuras.

source: །འཇིག་རྟེན་ཁམས་འདི་སེམས་ཅན་ཅི་ཡོད་པས།
en: “If the beings that are in this world

source: །བྱང་ཆུབ་སེམས་དཔའི་བསྔགས་པ་བརྗོད་གྱུར་ལ།
en: Were to recite the praises of the bodhisattvas

source: །དེ་ལ་ཡིད་ནི་རྗེས་སུ་དགར་བྱེད་ན།
en: And they were to take great joy in that

source: །སངས་རྒྱས་ཡེ་ཤེས་ལ་ནི་བསླབས་མ་ཡིན།
en: Then they would not be trained in the Buddha’s wisdom. {19}

source: །འཇིག་རྟེན་ཁམས་འདིའི་སེམས་ཅན་སུ་ཡོད་པས།
en: “If all the beings that are in this world

source: །བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་མི་སྙན་བརྗོད།
en: Were to speak badly to the bodhisattvas,

source: དེ་དག་ལ་ནི་ཡིད་ཀྱིས་ཁྲོ་བྱེད་ན།
en: And if they were to become angry toward them,

source: །ད་དུང་སངས་རྒྱས་ཡེ་ཤེས་དེས་མ་བསླབས།
en: Then they would still not be trained in the Buddha’s wisdom. {20}

source: །ནོར་རྙེད་པས་ནི་ཡིད་བདེར་མི་འགྱུར་ཏེ།
en: “If they gain wealth it does not make them happy;

source: །ནོར་རྣམས་མ་རྙེད་ན་ཡང་མི་དགའ་མེད།
en: If they do not gain wealth it does not make them unhappy.

source: །རི་དང་འདྲ་བའི་སེམས་ལ་རྟག་ཏུ་གནས། །འདི་དག་བཟོད་པ་གསུམ་པའི་ཁྱད་པར་རོ།
en: Their minds always remain like a mountain. These are distinctive qualities of the third patience. {21} “These three patiences are taught to be the patience regarding what is spoken,

source: །སྒྲ་ཡི་རྗེས་འགྲོ་བཟོད་པ་འདི་བསྟན་ཏེ།
en: The patience that is beneficial for contemplation and meditation,

source: །བསམ་པ་སྒོམ་པ་རྗེས་སུ་འཐུན་པ་དང་། །ཐོས་པ་ལས་བྱུང་དེ་ནི་སྐྱེ་བ་མེད།
en: And the patience, from listening to the Dharma, regarding birthlessness.

source: །འདི་ལ་གང་བསླབས་དེ་ནི་བྱང་ཆུབ་ལམ།
en: These trainings are the path to enlightenment. {22} “When the bodhisattvas attain

source: །བཟོད་པ་བླ་ན་མེད་པ་གསུམ་པོ་འདི། །བྱང་ཆུབ་སེམས་དཔས་ནམ་ཞིག་ཐོབ་གྱུར་ན།
en: These three unsurpassable patiences,

source: །མི་མཆོག་བདེ་བར་གཤེགས་པ་དེས་མཐོང་སྟེ།
en: They see the supreme humans, the sugatas,

source: །རྡུལ་མེད་བྱང་ཆུབ་ཏུ་ཡང་དེ་ལུང་སྟོན།
en: And they give them the prophecy of their stainless enlightenment. {23}

source: །དེ་ནས་ལུང་བསྟན་པ་ནི་དེ་ཐོབ་ནས།
en: “When they have received that prophecy

source: །ས་ཡང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས།
en: The earth shakes in six ways,

source: །ཞིང་རྣམས་འོད་ཀྱིས་ཤིན་ཏུ་གསལ་བར་གྱུར།
en: The realm is illuminated by light,

source: །ལྷ་རྣམས་བྱེ་བ་མེ་ཏོག་ཆར་པ་འབེབས།
en: And millions of devas send down a rain of flowers. {24}

source: །དེ་ལ་ལུང་བསྟན་དེ་ཡང་ཐོས་ནས་ནི།
en: “When they have received that prophecy

source: །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་ཡས་ཀྱང་།
en: Countless quintillions of beings

source: །བདག་ཅག་མཆོད་རྟེན་རྒྱལ་བར་འགྱུར་སྙམ་སྟེ། །བྱང་ཆུབ་དམ་པ་མཆོག་ལ་སེམས་སྐྱེད་འགྱུར།
en: Develop the aspiration to enlightenment, Thinking, ‘We also shall become jinas, worthy of offerings.’ {25}

source: །ནམ་ཞིག་བླ་མེད་བཟོད་པ་གསུམ་པོ་འདི། །བྱང་ཆུབ་སེམས་དཔས་ཐོབ་པར་གྱུར་པ་ན།
en: “When the bodhisattvas attain These three unsurpassable patiences

source: །དེ་ནི་མི་སྐྱེ་འཆི་བར་མི་འགྱུར་ཏེ།
en: They are not born, they do not die,

source: །དེ་ལ་འཆི་འཕོ་མེད་ཅིང་སྐྱེ་བའང་མེད།
en: They do not pass away, and are not reborn. {26}

source: །ནམ་ཞིག་བླ་མེད་བཟོད་པ་གསུམ་པོ་འདི། །རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔས་ཐོབ་གྱུར་ན།
en: “When the bodhisattvas attain These three unsurpassable patiences

source: །སྐྱེ་བ་དང་ནི་འཆི་བའང་མི་མཐོང་སྟེ།
en: They do not see beings born or dying,

source: །ཆོས་རྣམས་ཐམས་ཅད་ཆོས་ཉིད་གནས་པར་མཐོང་།
en: But see all phenomena as remaining in the true nature. {27}

source: །འདི་ལྟར་མི་བདེན་པར་ནི་དེས་རིག་སྟེ།
en: “In this way they know that they are untrue,

source: །ཆོས་རྣམས་སྒྱུ་མ་ལྟ་བུར་རང་བཞིན་སྟོང་།
en: That phenomena are like illusions, that they are naturally empty.

source: །སྟོང་པ་དག་ཀྱང་མི་མཐོང་འཆི་བའང་མེད།
en: Emptiness is not born and does not die.

source: །ཆོས་འདི་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་།
en: All these phenomena are by nature empty. {28}

source: །ནམ་ཞིག་ལ་ལས་དེ་ལ་གུས་བྱས་ཤིང་།
en: “Whenever someone shows them respect,

source: །རིམ་གྲོ་བཀུར་སྟི་མཆོད་པ་བྱས་ན་ཡང་།
en: Attending to them, honoring them, and making offerings,

source: །དེ་ལ་ཡིད་ནི་དགའ་བར་མི་བྱེད་དེ།
en: They take no pleasure in it,

source: །ཆོས་རྣམས་རང་བཞིན་སྟོང་པར་དེ་ཡིས་ཤེས།
en: For they know that phenomena have an empty nature. {29}

source: །སེམས་ཅན་དག་གིས་སྤྱོས་བསྡིགས་བརྡེགས་ན་ཡང་།
en: “Toward beings who revile, threaten, or beat them,

source: །དེ་དག་ལ་ནི་ང་རྒྱལ་ཁྲོ་མི་སྲིད།
en: They feel no anger, nor pride. They only feel constant love for them,

source: །དེ་དག་སེམས་ཅན་ཐར་པར་བྱ་བའི་ཕྱིར། །དེ་དག་ལ་ནི་བྱམས་པ་བརྟན་པར་སྐྱེད།
en: Wishing for those beings to be liberated. {30}

source: །རྡོ་དང་དབྱུག་པ་དག་གིས་བརྡེགས་བཙོགས་ཀྱང་།
en: “Even when beaten and cut with sticks and stones,

source: །མཁས་པ་དེ་ལ་ཁྲོ་བར་མི་བྱེད་དེ།
en: Those wise ones will feel no anger,

source: །བདག་མེད་བཟོད་ལ་རབ་ཏུ་གནས་པ་ལ།
en: Remaining in the patience of selflessness,

source: །ང་རྒྱལ་དང་ནི་ཁྲོ་བའི་ཐ་བ་མེད།
en: And not having unyielding anger or pride. {31}

source: །འདི་ལྟར་དེས་ནི་མི་བདེན་ཉིད་དུ་ཤེས།
en: “In this way they know the lack of reality,

source: །སྒྱུ་མ་ལྟ་བུར་ཆོས་རྣམས་རང་བཞིན་སྟོང་།
en: That phenomena are like illusions, with an empty nature.

source: །ཆོས་ཚུལ་དེ་འདྲ་བ་ལ་དེ་གནས་ན།
en: They remain in that knowledge of phenomena

source: །ལྷར་བཅས་འཇིག་རྟེན་དག་ན་ཤིན་ཏུ་བཀུར།
en: And are venerated by this world and its devas. {32}

source: །ནམ་ཞིག་སེམས་ཅན་དག་ནི་མཚོན་ཐོགས་ནས།
en: “Even toward beings holding weapons

source: །དེ་ཡི་ལུས་དང་ཡན་ལག་མང་གཏུབས་ཀྱང་།
en: Who cut into pieces their body and limbs,

source: །དེ་དག་ལ་ནི་ཡིད་ཀྱིས་ཁྲོ་བ་མེད།
en: They would have no anger,

source: །སྙིང་རྗེ་བྱམས་པ་ལས་ཀྱང་ཉམས་མི་འགྱུར།
en: And their love and compassion would not diminish. {33}

source: །དེ་དག་ལུས་དང་ཡན་ལག་གཅོད་པའི་ཚེ།
en: “Toward such beings, while they are cutting up their body and limbs,

source: །དེ་ནི་དེ་ལ་འདི་ལྟར་སེམས་བསྐྱེད་དེ།
en: This is what arises in their mind:

source: །འདི་དག་བྱང་ཆུབ་མཆོག་ལ་མ་བཀོད་པར། །དེ་སྲིད་ཞི་བར་མྱ་ངན་ང་མི་འདའ།
en: ‘Until I can bring these beings to enlightenment I will not pass into the peace of nirvāṇa.’ {34} “The bodhisattvas of great renown Continuously meditate throughout millions of eons

source: །དེ་འདྲའི་བཟོད་སྟོབས་བླ་ན་མེད་པ་ལ།
en: With that kind of unsurpassable power of patience,

source: །བདག་མེད་བཟོད་པ་མཉམ་ཉིད་གནས་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་གྲགས་པ་ཆེན་པོ་ཡིས།
en: Resting in the equanimity of the patience of selflessness. {35}

source: །བསྐལ་པ་བྱེ་བར་རྟག་ཏུ་ཤིན་ཏུ་བསྒོམས། །དེ་ལས་ལྷག་པར་གང་གཱའི་བྱེ་སྙེད་དུ།
en: “For even more eons, as many as Ganges sand grains,

source: །ཇི་ཙམ་སངས་རྒྱས་མཁྱེན་པས་དོན་མི་བྱེད།
en: They do not accomplish benefit through the knowledge of a buddha.

source: །དེ་སྲིད་བྱང་ཆུབ་རེག་པ་མ་ཡིན་ན། །དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཅི་ཞིག་སྨོས།
en: They do not reach enlightenment, Let alone the wisdom of the tathāgatas. {36} “Even if one were to speak for countless hundreds of eons, It would be difficult to conclude the praises,

source: །གྲགས་པ་ཆེན་པོ་བརྗོད་པ་མཐའ་ཡས་པ།
en: The endless descriptions, of the greatly renowned ones

source: །བདག་མེད་བཟོད་ལ་རབ་ཏུ་གནས་པ་ཡི། །བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་བརྒྱར་བརྗོད་ཀྱང་། །དེ་ཡི་བསྔགས་པ་ཟད་པར་སླ་བ་མིན།
en: Who are established in the patience of selflessness. {37}

source: །དེ་ཕྱིར་བྱང་ཆུབ་མཆོག་རབ་བླ་ན་མེད། །ཡེ་ཤེས་ཕུང་པོ་འཚང་རྒྱར་སུ་འདོད་པ།
en: “Therefore, the one who desires supreme, unsurpassable enlightenment, The accumulated wisdom of buddhahood,

source: །དེ་ནི་རྒྱལ་བས་བསྔགས་པའི་བཟོད་པ་སྒོམས།
en: Should meditate on the patience praised by the jinas,

source: །བྱང་ཆུབ་དམ་པ་རྙེད་པར་དཀའ་མི་འགྱུར།
en: And then supreme enlightenment will not be difficult to attain.” {38}

source: །བཟོད་པ་ལ་འཇུག་པའི་ལེའུ་སྟེ་བདུན་པའོ།། །།
en: Conclusion of seventh chapter, “The Attainment of Patience.” Buddha Abhāva­samudgata Chapter 8

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་ཅིང་། །མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་མཁས་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should become skilled in the wisdom of the nonexistent nature of all phenomena.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་མཁས་པ་ཡིན་ཞེ་ན། གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པ། ངོ་བོ་ཉིད་མེད་པ། མཚན་མ་མེད་པ། མཚན་ཉིད་མེད་པ། མ་སྐྱེས་པ།
en: “Young man, what is being skilled in the wisdom of the nonexistent nature of all phenomena?

source: མ་འགགས་པ། ཡི་གེ་མེད་པ། སྟོང་པ། གཟོད་མ་ནས་ཞི་བ། རང་བཞིན་གྱིས་རྣམ་པར་དག་པ་ཡིན་པར་རབ་ཏུ་ཤེས་པར་བྱའོ།
en: Bodhisattva mahāsattvas know that all phenomena have no existence, have no essence, have no attributes, have no characteristics, have no origin, have no cessation, have no words, are empty, are primordial peace, and are pure by nature.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནམ་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པ། ངོ་བོ་ཉིད་མེད་པ། མཚན་མ་མེད་པ། མཚན་ཉིད་མེད་པ། མ་སྐྱེས་པ། མ་འགགས་པ།
en: “Young man, when bodhisattva mahāsattvas know that all phenomena have no existence, have no essence, have no attributes, have no characteristics, have no birth, have no cessation, have no words, are empty, are primordial peace, and are pure by nature, then at that time, young man, those bodhisattva mahāsattvas have become skilled in the wisdom of the nonexistent nature of all phenomena.

source: ཡི་གེ་མེད་པ། སྟོང་པ། གཟོད་མ་ནས་ཞི་བ། རང་བཞིན་གྱིས་རྣམ་པར་དག་པ་ཡིན་པར་རབ་ཏུ་ཤེས་པར་གྱུར་པ་དེའི་ཚེ་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་མཁས་པ་ཞེས་བྱའོ། །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་མཁས་པ་དེ་ནི་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་ཐམས་ཅད་ལ་འདོད་ཆགས་པར་མི་བྱེད།
en: “Young man, bodhisattva mahāsattvas who have become skilled in the wisdom of the nonexistent nature of all phenomena do not have desire for any form, sound, smell, taste, or touch.

source: ཞེ་སྡང་བར་མི་བྱེད།
en: They do not become angry.

source: གཏི་མུག་པར་མི་བྱེད་དོ།
en: They are never ignorant.

source: འདི་ལྟར་དེས་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་།
en: It is because they do not see phenomena;

source: ཆོས་དེ་མི་དམིགས་ཏེ།
en: there is no object to perceive.

source: གང་འདོད་ཆགས་པ་དང་གང་ལ་འདོད་ཆགས་པ་དང་གང་གིས་འདོད་ཆགས་པ་དང་གང་ཞེ་སྡང་བ་དང་གང་ལ་ཞེ་སྡང་བ་དང་གང་གིས་ཞེ་སྡང་བ་དང་གང་གཏི་མུག་པ་དང་གང་ལ་གཏི་མུག་པ་དང་གང་གིས་གཏི་མུག་པར་འགྱུར་བའི་ཆོས་དེ་དེས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་མི་དམིགས་སོ།
en: They do not see the phenomena of desire, the desire, or the desirer; that which angers, the anger, or one who is angry; nor that of which one is ignorant, the ignorance, or the one who is ignorant, and therefore there is no such object to perceive.

source: །ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་མ་དམིགས་ན་ཁམས་གསུམ་ཐམས་ཅད་ལ་མ་ཆགས་པར་འགྱུར་ཏེ་མྱུར་དུ་ཏིང་ངེ་འཛིན་འདི་འཐོབ་བོ། །མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: “Because there is nothing to be seen and there is no object to perceive, they have no attachment to anything in the three realms and they will quickly attain this samādhi, and quickly attain the highest, complete enlightenment of perfect buddhahood.

source: །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: “On this topic, it has been said:

source: ཆོས་རྣམས་ཐམས་ཅད་དངོས་པོ་མེད་པ་སྟེ།
en: “All phenomena have no existence;

source: །ཐམས་ཅད་མཚན་མ་མེད་ཅིང་མཚན་ཉིད་མེད།
en: They are all devoid of attributes and without characteristics,

source: །སྐྱེས་པ་མེད་ཅིང་འགགས་པ་མེད་པར་ཡང་།
en: Without birth and without cessation.

source: །དེ་ལྟར་ཆོས་རྣམས་ཤིན་ཏུ་རིག་པར་གྱིས།
en: That is how you should perfectly understand phenomena.

source: །ཐམས་ཅད་དངོས་པོ་མེད་ཅིང་ཡི་གེ་མེད།
en: “Everything is without existence, without words,

source: །སྟོང་པ་ཞི་བ་གཟོད་ནས་དྲི་མ་མེད།
en: Empty, peaceful, and primordially stainless.

source: །དེ་ལྟར་ཆོས་རྣམས་གང་གིས་ཤེས་པ་ནི།
en: The one who knows phenomena,

source: །གཞོན་ནུ་དེ་ནི་སངས་རྒྱས་ཞེས་ཀྱང་བརྗོད།
en: Young man, that one is called a buddha.

source: །དེ་ཕྱིར་རང་བཞིན་མཉམ་ཉིད་རྣམས་སྤྲོས་པ།
en: “Therefore, the revealed nature of equality

source: །ངོ་བོ་ཉིད་ཀྱིས་ཆོས་ཀུན་རང་བཞིན་མེད།
en: Is that all phenomena in essence have no nature.

source: །བདེ་བར་གཤེགས་པའི་ཡུམ་འདི་སུ་འདོད་པ། །རྒྱལ་བ་རྣམས་ཀྱི་ཡུམ་འདི་འཐོབ་པར་འགྱུར། །གཞོན་ནུ་དེ་ལྟ་བས་ན་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གཞོན་ནུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། རྒྱ་ཆེ་བ། གཞལ་དུ་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ།
en: Whoever desires the mother of the sugatas Will attain this mother of the jinas. “Therefore, young man, that is what you should understand through this Dharma teaching.

source: ཚད་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དངོས་པོ་མེད་པ་ལས་བྱུང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་།
en: “Young man, in the past, countless, vast, immeasurable, inconceivable, unfathomable, asaṃkhyeya eons ago, at that time, in that time, there appeared in the world the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Abhāva­samudgata, who was perfect in wisdom and conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of devas and humans, a buddha, and a bhagavān.

source: །གཞོན་ནུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Young man, what do you think?

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དངོས་པོ་མེད་པ་ལས་བྱུང་བ་ཞེས་བྱ་ཞེ་ན།
en: Why was that tathāgata named Abhāva­samudgata?

source: གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དེ་སྐྱེས་མ་ཐག་ཏུ་སྟེང་གི་ནམ་མཁའ་ལ་ཏ་ལ་བདུན་ཙམ་དུ་འཕགས་ནས་གོམ་པ་བདུན་བོར་ཏེ་ཚིག་འདི་སྐད་གསུང་ངོ་།
en: “Young man, as soon as he was born he rose in the air up to the height of seven palm trees, took seven steps, and said these words:

source: །ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པ་ལས་བྱུང་བའོ།
en: ‘All phenomena have arisen from nonexistence.

source: །ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པ་ལས་བྱུང་བའོ་ཞེས་གསུངས་ཏེ།
en: From nonexistence have all phenomena arisen.’

source: གཞོན་ནུ་སྒྲ་དེའི་དབྱངས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གོ་བར་བྱས་སོ།
en: “Young man, the sound of those words was heard in all the worlds in the trichiliocosm.

source: །དེ་ནས་སའི་ལྷ་ནས་བཟུང་སྟེ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སྒྲ་བསྒྲགས་ཤིང་དབྱངས་ཀྱིས་རྗེས་སུ་གོ་བར་བྱས་ཏེ།
en: It resounded and was heard by everyone from the devas on the earth up to those in Brahmā’s paradise.
